app/Http/Models/BelongModel.php

select "belong_name" from "m_belong" where "last_kind" <> '9' and "belong_id" = '2' limit 1
---
    static function get_division_by_id($belong_id)
    {
        return DB::table('m_belong')->select('belong_name')->where('last_kind', '<>', DELETE)->where('belong_id', '=', $belong_id)->first();

select "belong_id" from "m_belong" where "last_kind" <> '9' and "belong_parent_id" = '1' order by "belong_sort" asc
---
    public function get_list_by_id($id)
    {
        $belong_parent = array();
        $results = DB::table($this->table)
                        ->select('belong_id')
                        ->where('last_kind', '<>', DELETE)
                        ->where(function($query) use ($id){
                                                 $query->where('m_belong.belong_id',  '=', $id)
                                                       ->orWhere('m_belong.belong_parent_id','=', $id);
                        })
                        ->orderBy('belong_sort', 'asc')
                        ->get();