app/Http/Models/SearchModel.php


        		->select('t_timecard.tt_date', 't_timecard.tt_gotime', 't_timecard.tt_backtime', 't_pc.tp_logintime', 't_pc.tp_logouttime')

                ->where('t_staff.staff_id_no', $staff_id_no)
                ->whereDate('t_timecard.tt_date', '>=', $date_from)
                ->whereDate('t_timecard.tt_date', '<=', $date_to)
                ->orderBy('t_timecard.tt_date', 'asc')
                ->get()->toArray();
---
select "t_timecard"."tt_date", "t_timecard"."tt_gotime", "t_timecard"."tt_backtime" from "t_staff" left join "t_timecard" on "t_staff"."staff_id_no" = "t_timecard"."tt_staff_id_no" where "t_staff"."staff_id_no" = 'E003' and extract(year from "t_timecard"."tt_date") >= '2017' and extract(month from "t_timecard"."tt_date") >= '09' and extract(year from "t_timecard"."tt_date") <= '2017' and extract(month from "t_timecard"."tt_date") <= '10' order by "t_timecard"."tt_date" asc