app/Http/Models/StaffModel.php

select * from "t_staff" where "staff_id" = '1' limit 1
---
    public function get_by_id($id)
    {
        $results = DB::table($this->table)->where('staff_id', $id)->first();

select * from "t_staff" where "t_staff"."last_kind" <> '9' and "t_staff"."staff_belong" in ('2')
---
    public function search_staff($where=null){

        $sql = DB::table($this->table)->where('t_staff.last_kind', '<>', DELETE);

        $sql = $sql->whereIn('t_staff.staff_belong', $where['belong_parent_id']);

        if(!empty($where['kw'])){
            $sql = $sql->where('t_staff.staff_id_no', $where['kw'])->orWhere('t_staff.staff_name', 'like', '%'.$where['kw'].'%');
        }

    return $sql->get();