app/Http/Models/UserModel.php

select * from "m_user" where "last_kind" <> '9' order by "u_name" asc, "last_date" desc limit 11 offset 0
---
    public function getAllUser(){
        return DB::table($this->table)->where('last_kind', '<>', DELETE)->orderBy('u_name', 'ASC')->orderBy('last_date', 'DESC')->get();

update "m_user" set "last_kind" = '9', "last_date" = '2017-10-26 12:57:22', "last_ipadrs" = '127.0.0.1', "last_user" = '3' where "u_id" = '5'
---
    public function update($id, $data)
    {
        return DB::table($this->table)->where('u_id', $id)->update($data);