app/Http/Controllers/Backend/UsersController.php

select * from "m_user" where "u_id" = '3' limit 1
---
	public function postLogin(){
		$clsUser            = new UserModel();
		$validator = Validator::make(Input::all(), $clsUser->RulesLogin(), $clsUser->MessagesLogin());